*> 見出し部
IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

*> 環境部
ENVIRONMENT DIVISION.

*> データ部
DATA DIVISION.
  WORKING-STORAGE SECTION.
    01 MY-DATA1 PIC X(20). *> PIC=領域を描く

*> 手続き部
PROCEDURE DIVISION.
  MAIN SECTION.
    MOVE "HELLO WORLD!!" TO MY-DATA1.
    DISPLAY MY-DATA1.
    DISPLAY MY-DATA1.

    STOP RUN. *> 最後に止める
